Repository: Esukhia/Corpora
Catalog: Parallel/84000/UT22084-044-005.tmx
Source language: bo
Languages: en

source: འཕགས་པ་བྱམས་པས་ཞུས་པ་ཞེས་བྱ་བ་
en: The Question of Maitreya

source: ﻿ ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Mahāyāna Sūtra

source: སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all the buddhas and bodhisattvas!

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus have I heard at one time.

source: བཅོམ་ལྡན་འདས་ཡུལ་བརྒ་ན་ཆུ་སྲིན་བྱིས་པ་གསོད་ལྟ་བུའི་རི་འཇིགས་སུ་རུང་བའི་ནགས་རི་དགས་ཀྱི་ནགས་ན་
en: The Blessed One was staying in the Country of the Bhargas, on Mount Śuśumāra in a fearsome forest of wild animals,

source: དགེ་སློང་ལྔ་བརྒྱ་ཙམ་གྱི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་མངོན་པར་ཤེས་པ་མངོན་པར་ཤེས་པ་གནས་བརྟན་ཉན་ཐོས་ཆེན་པོ་ཤ་སྟག་ལ།
en: eminent śrāvaka-elders who possessed clairvoyance.

source: འདི་ལྟ་སྟེ།
en: These included

source: ཚེ་དང་ལྡན་པ་ཀུན་ཤེས་ཀཽ་ཌི་ནྱ་དང་།
en: the omniscient venerable Kauṇḍinya,

source: ཚེ་དང་ལྡན་པ་རྟ་ཐུལ་དང་།
en: and the venerables Aśvajit,

source: ཚེ་དང་ལྡན་པ་རླངས་པ་དང་།
en: Vaṣpa,

source: ཚེ་དང་ལྡན་པ་མིང་ཆེན་དང་།
en: Mahānāman,

source: ཚེ་དང་ལྡན་པ་བཟང་ལྡན་དང་།
en: Bhadrika,

source: ཚེ་དང་ལྡན་པ་དྲི་མ་མེད་དང་།
en: Vimala,

source: ཚེ་དང་ལྡན་པ་གང་པོ་དང་།
en: Pūrṇa,

source: ཚེ་དང་ལྡན་པ་བ་ལང་བདག་དང་།
en: Gavāṃpati,

source: ཚེ་དང་ལྡན་པ་རི་དགས་མགོ་དང་།
en: Mṛgaśiras,

source: ཚེ་དང་ལྡན་པ་ལྟེང་རྒྱས་འོད་སྲུང་དང་།
en: Uruvilva Kāśyapa,

source: ཚེ་དང་ལྡན་པ་ཆུ་ཀླུང་འོད་སྲུང་དང་།
en: Nadī Kāśyapa,

source: ཚེ་དང་ལྡན་པ་ག་ཡ་འོད་སྲུང་དང་།
en: Gayā Kāśyapa,

source: ཚེ་དང་ལྡན་པ་བྱིན་པ་འོད་སྲུང་དང་།
en: Jaṅghā Kāśyapa,

source: ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་དང་།
en: Mahākāśyapa,

source: ཚེ་དང་ལྡན་པ་དོན་ཡོད་རྒྱལ་པོ་དང་།
en: Amogharāja,

source: ཚེ་དང་ལྡན་པ་བློ་གྲོས་བཟང་དང་།
en: Sumati,

source: ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དང་།
en: Śāriputra,

source: ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་དང་།
en: the eminent Maudgalyāyana,

source: ཚེ་དང་ལྡན་པ་རི་རྒྱལ་དང་།
en: Parvatarāja,

source: ཚེ་དང་ལྡན་པ་དགའ་བོ་དང་།
en: Nanda,

source: ཚེ་དང་ལྡན་པ་ཉེ་དགའ་དང་།
en: Upananda,

source: ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་།
en: Ānanda,

source: ཚེ་དང་ལྡན་པ་སྒྲ་གཅན་ཟིན་དང་།
en: Rāhula,

source: དེ་དག་ལ་སོགས་པ་
en: and so on.

source: དགེ་སློང་ལྔ་བརྒྱ་ཙམ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་སོ།
en: together with a great saṅgha of about 500 monks,

source: །བྱམས་པ་ལ་སོགས་པ་
en: Maitreya and

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མངོན་པར་ཤེས་པ་མངོན་པར་ཤེས་པ་ཁྲི་དང་ཡང་ཐབས་ཅིག་ལ་
en: 10,000 other bodhisattva mahāsattvas endowed with clairvoyance had also assembled there.

source: བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་འཕེལ་དང་།
en: the bodhisattvas Vardhamānamati,

source: བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་བཟང་དང་།
en: Sumati,

source: བྱང་ཆུབ་སེམས་དཔའ་བློ་གྲོས་བརྟན་དང་།
en: Sthiramati,

source: བློ་གྲོས་ཡངས་པ་དང་།
en: Viśālamati,

source: སྤོབས་པ་བརྩེགས་དང་།
en: Pratibhānakūṭa,

source: སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་།
en: Avalokiteśvara,

source: མཐུ་ཆེན་ཐོབ་དང་།
en: Mahāsthāmaprāpta,

source: ཏོག་དཔལ་དང་།
en: Kusumaśrī,

source: འཇམ་དཔལ་དང་།
en: Mañjuśrī,

source: མངོན་པར་ཤེས་པའི་མེ་ཏོག་ཤིན་ཏུ་རྒྱས་པ་དང་།
en: Abhijñāpuṣpasuparipūrṇa,

source: དམིགས་པ་མེད་པ་ཡིད་ལ་བྱེད་པ་དང་།
en: Anupalambhamanasikāra,

source: དད་ལྡན་དང་།
en: Prasādavat,

source: རིན་པོ་ཆེའི་ཏོག་དང་།
en: Ratnaketu,

source: དབང་པོའི་ལྷ་དང་།
en: Indradeva,

source: ཆུ་ལྷ་དང་།
en: Varuṇadeva,

source: སྒྲ་དབྱངས་སྙན་དང་།
en: Mṛdusvara,

source: ཞིང་རྣམ་པར་སྦྱོང་དང་།
en: Kṣetraviśodhana,

source: ལྷུན་པོ་བརྩེགས་དང་།
en: Merukūṭa,

source: སྤོབས་པ་ཕུན་སུམ་ཚོགས་དང་།
en: Pratibhānasaṃpad,

source: དབང་པོའི་དཔལ་དང་།
en: Indraśrī,

source: ས་འཛིན་དང་།
en: Nimiṃdhara,

source: སེམས་ཅན་དམྱལ་བ་སྐེམས་དང་།
en: Scourer of the Hell-Dwellers,

source: ངན་སོང་སྤོང་དང་།
en: Abandoner of Unfavorable Rebirths,

source: རིན་ཆེན་ཟེ་བ་ཅན་དང་དེ་དག་ལ་སོགས་པ་
en: Ratnakesarin and others.

source: དེ་ནས་བཅོམ་ལྡན་འདས་
en: The Blessed One,

source: བྱང་ཆུབ་སེམས་དཔའ་ཁྲི་དང་ཐབས་ཅིག་སྟེ།འཁོར་བརྒྱ་སྟོང་དུ་མས་ཡོངས་སུ་བསྐོར་ཅིང་
en: surrounded by this retinue of many hundreds of thousands,

source: མདུན་གྱིས་བལྟས་ནས་
en: surveyed those before him,

source: ཆོས་སྟོན་ཏོ།
en: and taught the Dharma.

source: །དེའི་ཚེ་
en: At that time,

source: བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏེ་འདུག་གོ
en: the bodhisattva Maitreya was present in that very retinue.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་ཆེན་པོ་དེ་འདུས་པར་རིག་ནས་སྟན་ལས་ལངས་ཏེ།
en: He surveyed the great assembly of bodhisattvas, rose from his seat,

source: བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་
en: draped his upper shawl over one shoulder,

source: པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: set his right knee on the ground, and

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་
en: to the Blessed One.

source: ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས།
en: paid homage with palms joined

source: བཅོམ་ལྡན་འདས་ལ་
en: Blessed One,

source: འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: He asked the

source: །གལ་ཏེ་ཞུས་ནས་ཞུ་བ་ལུང་བསྟན་པའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ལ་སྐབས་ཕྱེ་ན
en: “Would the Blessed One, if he has time, please answer a certain question that I would like to put to the

source: ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་བདག་ཕྱོགས་འགའ་ཞིག་ཞུའོ།
en: Tathāgata, the Arhat, the completely and perfectly enlightened Buddha?”

source: །དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: then replied to the

source: བཅོམ་ལྡན་འདས་ཀྱིས་
en: The Blessed One

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: bodhisattva mahāsattva Maitreya, “Maitreya, the

source: དེ་བཞིན་གཤེགས་པས་རྟག་ཏུ་སྐབས་ཕྱེས།
en: Tathāgata always has time to answer such questions.

source: བྱམས་པ་ཁྱོད་ཅི་དང་ཅི་འདོད་པ་དྲིས་ཤིག་དང་། དྲིས་པ་དེ་དང་དེའི་ལུང་བསྟན་པས།
en: Ask whatever you wish, Maitreya.

source: །བྱམས་པ་དྲི་བ་ལུང་བསྟན་པའི་ཕྱིར། སེམས་རངས་པར་བྱའོ།
en: What I shall say in response to your question will cause you to rejoice.”

source: །དེ་ནས་
en: So

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པས་
en: the bodhisattva mahāsattva Maitreya

source: །བཅོམ་ལྡན་འདས་
en: “Blessed One,

source: བྱང་ཆུབ་སེམས་དཔའ་ཆོས་དུ་དང་ལྡན་ན་ངན་སོང་ཐམས་ཅད་སྤོང་ཞིང་
en: how many qualities does a bodhisattva need to possess in order to abandon all evil rebirths and

source: སྡིག་པའི་གྲོགས་པོའི་སུག་པར་མཆི་བར་མི་འགྱུར་ལ།
en: not fall into the clutches of sinful associates,

source: མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་ལགས།
en: but swiftly realize supreme, perfect enlightenment and become a buddha?”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: answered

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་ལ་
en: bodhisattva mahāsattva Maitreya,

source: །བྱམས་པ་
en: “Maitreya,

source: ཁྱོད་ནི་འདི་ལྟར་སྔོན་གྱི་རྒྱལ་བ་ལ་ལྷག་པར་བྱ་བ་བྱས་པ།
en: you have served the victorious ones of the past,

source: འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: answered the

source: དགེ་བའི་རྩ་བ་བསྐྱེད་པ།
en: cultivated the roots of virtue,

source: ཚེ་རབས་དྲན་པ།
en: recalled your past lives,

source: སྤོབས་པ་ཐོབ་པ།
en: acquired eloquence, and

source: ཡུན་རིང་པོ་ནས་ཚངས་པར་སྤྱོད་པ་སྤྱད་པ་སྟེ།
en: for a long time, lived chastely.

source: བྱམས་པ་ཁྱོད་སྐྱེ་བོ་མང་པོ་ལ་ཕན་པ་དང་།
en: Maitreya, you work for the benefit of many people,

source: སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་།
en: bring happiness to many people,

source: འཇིག་རྟེན་ལ་སྙིང་བརྩེ་བ་དང་།
en: and are compassionate toward the world.

source: སྐྱེ་བོ་ཕལ་པོ་ཆེ་དང་།
en: and well-being to ordinary beings,

source: ལྷ་དང་མི་རྣམས་ཀྱི་དོན་དང་།
en: gods, and men,

source: ཕན་པ་དང་།
en: benefit,

source: བདེ་བ་དང་།
en: You live to bring welfare,

source: བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་
en: the vehicle of the bodhisattvas.

source: རིགས་ཀྱི་བུ་དང་།རིགས་ཀྱི་བུ་མོ་ད་ལྟར་གྱི་ང་།མ་འོངས་པ་རྣམས་
en: and to assist the noble sons and daughters, present and future, who belong to

source: ཡོངས་སུ་གཟུང་བའི་ཕྱིར་ཞུགས་ནས་ཁྱོད་དེ་བཞིན་གཤེགས་པ་ལ་དོན་འདི་འདྲི་བར་སེམས་པ་ལེགས་སོ་ལེགས་སོ།
en: It is indeed good that you have thought of asking the Blessed One a question on this subject.

source: དེའི་ཕྱིར་
en: Therefore,

source: ལེགས་པར་རབ་ཏུ་ཉོན་ལ་
en: listen well and carefully,

source: ཡིད་ལ་ཟུང་ཤིག་དང་བཤད་དོ།
en: and retain all that I say in your mind.”

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པས་
en: The bodhisattva mahāsattva Maitreya

source: བཅོམ་ལྡན་འདས་ལ་ལེགས་སོ་ཞེས་གསོལ་ཏེ
en: assented to the Blessed One, and

source: ་བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་།
en: listened as the Blessed One had instructed.

source: བཅོམ་ལྡན་འདས་ཀྱིས་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།།
en: The Blessed One said,

source: བྱམས་པ་
en: “Maitreya,

source: བྱང་ཆུབ་སེམས་དཔའ་ཆོས་གཅིག་དང་ལྡན་ན་
en: if a bodhisattva possesses one single quality,

source: ངན་སོང་ཐམས་ཅད་སྤོང་ཞིང་
en: he will abandon all evil rebirths and

source: སྡིག་པའི་གྲོགས་པོའི་ལག་ཏུ་མི་འགྲོ་ལ་
en: not fall into the clutches of sinful associates,

source: མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་སྟེ།
en: but swiftly realize supreme, perfect enlightenment and become a buddha.

source: ཆོས་གཅིག་གང་ཞེ་ན།
en: What is that single quality?

source: འདི་ལྟ་སྟེ། ལྷག་པའི་བསམ་པ་ཕུན་སུམ་ཚོགས་པའི་བྱང་ཆུབ་ཀྱི་སེམས་ཏེ།
en: Having the altruistic intention of excellent bodhicitta.

source: བྱང་ཆུབ་སེམས་དཔའ་ཆོས་གཅིག་པོ་དེ་དང་ལྡན་ན་
en: if a bodhisattva possesses this single quality,

source: མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: but swiftly realize supreme, perfect enlightenment and become a buddha.

source: གཞན་ཡང་
en: “Furthermore,

source: བྱང་ཆུབ་སེམས་དཔའ་ཆོས་གཉིས་དང་ལྡན་ན་
en: if a bodhisattva possesses two qualities,

source: གཉིས་གང་ཞེ་ན།
en: What two qualities?

source: འདི་ལྟ་སྟེ། ཞི་གནས་ཡོངས་སུ་ཚོལ་བ་དང་།
en: Thoroughly applying himself in calm abiding and

source: ལྷག་མཐོང་ལ་མཁས་པ་སྟེ།
en: developing skill in insight.

source: བྱང་ཆུབ་སེམས་དཔའ་ཆོས་གཉིས་པོ་དེ་དག་དང་ལྡན་ན་
en: If a bodhisattva possesses these two qualities,

source: བྱང་ཆུབ་སེམས་དཔའ་ཆོས་གསུམ་དང་ལྡན་ན་
en: if a bodhisattva possesses three qualities

source: གསུམ་གང་ཞེ་ན།
en: What three qualities?

source: འདི་ལྟ་སྟེ། སྙིང་རྗེ་ཆེན་པོ་ཐོབ་པ་དང་།
en: Attaining great compassion and

source: སྟོང་པ་ཉིད་ཀྱི་ཆོས་ངེས་པར་སེམས་པ་དང་།
en: having definitive understanding of the teaching of emptiness,

source: དེས་ཀྱང་རློམ་སེམས་མི་བྱེད་པ་སྟེ།
en: yet without being arrogant.

source: བྱང་ཆུབ་སེམས་དཔའ་ཆོས་གསུམ་པོ་དེ་དག་དང་ལྡན་ན་
en: if a bodhisattva possesses these three qualities,

source: སྡིག་པའི་གྲོགས་པོའི་ལག་ཏུ་མི་འགྲོ་ལ།
en: not fall into the clutches of sinful associates,

source: བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་
en: if a bodhisattva possesses four qualities,

source: བཞི་གང་ཞེ་ན།
en: What four qualities?

source: འདི་ལྟ་སྟེ། ཚུལ་ཁྲིམས་ལ་གནས་པ་ཡིན།
en: Observing moral conduct,

source: ཆོས་ཐམས་ཅད་ལ་སོམ་ཉི་མེད་པ་ཡིན།
en: having no doubt about the whole of the Dharma, delighting in seclusion, and

source: དགོན་པ་ལ་མངོན་པར་དགའ་བ་ཡིན།
en: not wavering from the undertaking to which he has committed himself.

source: ཡང་དག་པར་ཞུགས་ཤིང་ཡང་དག་པར་བླངས་པ་ལས་མི་གཡོ་བ་ཡིན་ཏེ།
en: Maitreya,

source: བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་
en: he will abandon all evil rebirths and

source: བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ལྔ་དང་ལྡན་ན་
en: he will abandon all evil rebirths and

source: སྡིག་པའི་གྲོགས་པོའི་ལག་ཏུ་མི་འགྲོ་ལ་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་སྟེ།
en: but swiftly realize supreme, perfect enlightenment and become a buddha.

source: ལྔ་གང་ཞེ་ན།
en: What five qualities?

source: འདི་ལྟ་སྟེ། སྟོང་པ་ཉིད་ལ་གནས་པ་དང་།
en: Dwelling in emptiness,

source: གཞན་དག་གི་འཁྲུལ་པ་མི་ཚོལ་བ་དང་།
en: not seeking the delusions of others,

source: བདག་ལྟ་རྟོག་པ་དང་།
en: investigating the self,

source: ཆོས་ལ་མངོན་པར་དགའ་བ་དང་།
en: delighting in the Dharma,

source: གཞན་ལ་ཕན་འདོགས་པར་ཞུགས་པ་ཡིན་ཏེ།
en: and being committed to helping others.

source: བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ལྔ་པོ་དེ་དག་དང་ལྡན་ན་
en: if a bodhisattva possesses these five qualities,

source: བྱང་ཆུབ་སེམས་དཔའ་ཆོས་དྲུག་དང་ལྡན་ན
en: if a bodhisattva possesses six qualities,

source: ་ངན་སོང་ཐམས་ཅད་སྤོང་ཞིང་
en: he will abandon all evil rebirths and

source: སྡིག་པའི་གྲོགས་པོའི་ལག་ཏུ་མི་འགྲོ་ལ
en: not fall into the clutches of sinful associates,

source: དྲུག་གང་ཞེ་ན།
en: What six qualities?

source: འདི་ལྟ་སྟེ། བརྐམ་པ་མེད་པ་ཡིན། སྡང་བ་མེད་པ་ཡིན། རྨོངས་པ་མེད་པ་ཡིན།
en: Being without attachment, aversion,and ignorance;

source: དྲིས་མ་ཐག་ཏུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ལན་ལྡོན་པ་ཡིན།
en: immediately answering questions correctly and properly;

source: བསྙེན་པར་དཀའ་བ་མེད་པ་ཡིན།
en: being tireless in his ritual observance;

source: སྟོང་པ་ཉིད་སྤྱོད་ཡུལ་བ་ཡིན་ཏེ།
en: and experiencing emptiness.

source: བྱང་ཆུབ་སེམས་དཔའ་ཆོས་དྲུག་པོ་དེ་དག་དང་ལྡན་ན་
en: if a bodhisattva possesses these six qualities,

source: བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བདུན་དང་ལྡན་ན་
en: if a bodhisattva possesses seven qualities,

source: སྡིག་པའི་གྲོགས་པོའི་ལག་ཏུ་མི་འ
en: not fall into the clutches of sinful associates,

source: གྲོ་ལ་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་སྟེ།
en: but swiftly realize supreme, perfect enlightenment and become a buddha.

source: བདུན་གང་ཞེ་ན།
en: What seven qualities?

source: འདི་ལྟ་སྟེ། དྲན་པ་ལ་མཁས་པ་ཡིན། ཆོས་ལ་མཁས་པ་ཡིན།
en: Being learned in mindfulness and in the Dharma.

source: བརྩོན་འགྲུས་བརྩམས་པ་ཡིན།
en: Being diligent in his undertakings,

source: དགའ་བ་ཐོབ་པ་ཡིན།
en: joyful,

source: ཤིན་ཏུ་སྦྱངས་པ་དང་ལྡན་པ་ཡིན།
en: mentally supple,

source: ཏིང་ངེ་འཛིན་ལ་མཁས་པ་ཡིན།
en: and skilled in meditative concentration and

source: ཤེས་རབ་ཀྱིས་རབ་ཏུ་དབྱེ་བ་ལ་མཁས་པ་ཡིན་ཏེ།
en: analysis through wisdom.

source: བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བདུན་པོ་དེ་དག་དང་ལྡན་ན་
en: if a bodhisattva possesses these seven qualities,

source: མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: but swiftly realize supreme, perfect enlightenment and become a buddha.

source: བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བརྒྱད་དང་ལྡན་ན་
en: if a bodhisattva possesses eight qualities,

source: བརྒྱད་གང་ཞེ་ན།
en: What eight qualities?

source: འདི་ལྟ་སྟེ། ཡང་དག་པའི་ལྟ་བ་ཅན་ཡིན།
en: Possessing right view,

source: ཡང་དག་པའི་རྟོག་པ་ཅན་ཡིན།
en: right thought,

source: ཡང་དག་པའི་ངག་ཅན་ཡིན།
en: right speech,

source: ཡང་དག་པའི་ལས་ཀྱི་མཐའ་ཅན་ཡིན།
en: right action,

source: ཡང་དག་པའི་འཚོ་བ་ཅན་ཡིན།
en: right livelihood,

source: ཡང་དག་པའི་རྩོལ་བ་ཅན་ཡིན།
en: right effort,

source: ཡང་དག་པའི་དྲན་པ་ཅན་ཡིན།
en: right mindfulness,

source: ཡང་དག་པའི་ཏིང་ངེ་འཛིན་ཅན་ཡིན་ཏེ།
en: and right concentration.

source: ཆོས་བརྒྱད་པོ་དེ་དག་དང་ལྡན་ན་
en: if a bodhisattva possesses these eight qualities,

source: བྱང་ཆུབ་སེམས་དཔའ་ཆོས་དགུ་དང་ལྡན་ན་
en: if a bodhisattva possesses nine qualities,

source: དགུ་གང་ཞེ་ན།
en: What nine qualities?

source: འདི་ལྟ་སྟེ། བྱམས་པ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་ནི་འདོད་པ་དག་ལས་དབེན་པ།
en: “Maitreya, that bodhisattva distances himself from desires and from sinful,

source: སྡིག་པ་མི་དགེ་བའི་ཆོས་རྣམས་ལས་དབེན་པ།
en: non-virtuous things.

source: རྟོག་པ་དང་བཅས་པ།
en: He investigates,

source: དཔྱོད་པ་དང་བཅས་པ།
en: examines,

source: དབེན་པ་ལས་སྐྱེས་པའི་དགའ་བ་དང་
en: and possesses the joy and happiness that arise from solitude.

source: བདེ་བ་ཅན་བསམ་གཏན་དང་པོ་བསྒྲུབས་ཏེ་གནས་སོ།
en: Thus, he accomplishes the first meditative absorption and maintains it.

source: །ཞེས་བརྗོད་པ་སྟེ།
en: The preceding passage is also found there.

source: དགའ་བ་མེད་པ་བསམ་གཏན་གསུམ་པ་བསྒྲུབས་ཏེ་གནས་སོ།
en: Free of joy he then accomplishes the third meditative absorption and maintains it.

source: །བདེ་བ་ཡང་སྤངས་ཏེ།
en: “He renounces happiness after already renouncing suffering.

source: སྔ་ནས་སྡུག་བསྔལ་ཡང་སྤངས་ཤིང་ཡིད་བདེ་བ་དང་ཡིད་མི་བདེ་བ་ཡང་ནུབ་པས་བདེ་བ་ཡང་མ་ཡིན།སྡུག་བསྔལ་བ་ཡང་མ་ཡིན་པ།
en: Because both mental happiness and mental displeasure decline, there is neither happiness nor suffering.

source: བཏང་སྙོམས་དང་དྲན་པ་ཡོངས་སུ་དག་པ་བསམ་གཏན་བཞི་པ་བསྒྲུབས་ཏེ་གནས་སོ།
en: He then accomplishes the fourth meditative absorption and maintains it, with immaculate equipoise and mindfulness.

source: །རྣམ་པ་ཐམས་ཅད་དུ་གཟུགས་ཀྱི་འདུ་ཤེས་རྣམས་ལས་ཡང་དག་པར་འདས་ཏེ།
en: “He transcends conceptions of form in all aspects, and his conceptions of materiality decline.

source: ཐོགས་པའི་འདུ་ཤེས་རྣམས་ནུབ་པར་གྱུར་ཅིང་སྣ་ཚོགས་ཀྱི་འདུ་ཤེས་རྣམས་ཡིད་ལ་མི་བྱེད་པས་ནམ་མཁའ་མཐའ་ཡས་སོ་སྙམ་ནས་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་བསྒྲུབས་ཏེ་གནས་སོ།
en: When he does not fabricate conceptions of any kind, he thinks, ‘This is the infinity of space,’ and then accomplishes the sphere of the infinity of space and maintains it.

source: །རྣམ་པ་ཐམས་ཅད་དུ་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ།རྣམ་པར་ཤེས་པ་མཐའ་ཡས་སོ་སྙམ་ནས་རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་བསྒྲུབས་ཏེ་གནས་སོ།
en: After he has transcended the sphere of the infinity of space in all aspects, he thinks, ‘This is the infinity of consciousness,’ and then accomplishes the sphere of the infinity of consciousness and maintains it.

source: །རྣམ་པ་ཐམས་ཅད་དུ་རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ཏེ།
en: After he has transcended the sphere of the infinity of consciousness in all aspects,

source: ཅི་ཡང་མེད་དོ་སྙམ་ནས་ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་བསྒྲུབས་ཏེ་གནས་སོ།
en: he thinks, ‘This is nothingness,’ and then accomplishes the sphere of nothingness and maintains it.

source: །རྣམ་པ་ཐམས་ཅད་དུ་ཅི་ཡང་མེད་པའི་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ནས་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་བསྒྲུབས་ཏེ་གནས་སོ།
en: After he has transcended the sphere of nothingness in all aspects, he then accomplishes the sphere of neither perception nor non-perception and maintains it.

source: །རྣམ་པ་ཐམས་ཅད་དུ་འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལས་ཡང་དག་པར་འདས་ནས་
en: After he has transcended the sphere of neither perception nor non-perception in all aspects,

source: འདུ་ཤེས་དང་ཚོར་བ་འགོག་པ་བསྒྲུབས་ནས་གནས་པ་སྟེ།
en: he then accomplishes the cessation of perception and feeling and maintains it.This is a fifth accomplishment sometimes added to the four formless absorptions.

source: བྱང་ཆུབ་སེམས་དཔའ་ཆོས་དགུ་པོ་དེ་དག་དང་ལྡན་ན་
en: if a bodhisattva possesses these nine qualities,

source: བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཅུ་དང་ལྡན་ན་
en: if a bodhisattva possesses ten qualities,

source: བཅུ་གང་ཞེ་ན།
en: What ten qualities?

source: འདི་ལྟ་སྟེ། རྡོ་རྗེ་ལྟ་བུའི་ཏིང་ངེ་འཛིན་དང་ལྡན་པ་ཡིན།
en: Having vajra-like meditative concentration,

source: གནས་དང་གནས་མ་ཡིན་པ་ལ་མངོན་པར་བརྩོན་པའི་ཏིང་ངེ་འཛིན་དང་ལྡན་པ་ཡིན།
en: meditative concentration that is assiduous regarding what is correct and incorrect,

source: ཐབས་ཀྱིས་འགྲོ་བའི་ཏིང་ངེ་འཛིན་དང་ལྡན་པ་ཡིན།
en: meditative concentration of going via methods,

source: རྣམ་པར་སྣང་བྱེད་ཀྱི་ཏིང་ངེ་འཛིན་དང་ལྡན་པ་ཡིན།
en: illuminating meditative concentration,

source: ཀུན་ནས་སྣང་བའི་ཏིང་ངེ་འཛིན་དང་ལྡན་པ་ཡིན།
en: all-illuminating meditative concentration,

source: ཀུན་དུ་གསལ་བའི་ཏིང་ངེ་འཛིན་དང་ལྡན་པ་ཡིན།
en: manifest meditative concentration,

source: རིན་ཆེན་ཟླ་བའི་ཏིང་ངེ་འཛིན་དང་ལྡན་པ་ཡིན།
en: precious moon meditative concentration,

source: ཟླ་བ་སྒྲོན་མའི་ཏིང་ངེ་འཛིན་དང་ལྡན་པ་ཡིན།
en: moon-lamp meditative concentration,

source: ཉོན་མོངས་པ་མེད་པའི་ཏིང་ངེ་འཛིན་དང་ལྡན་པ་ཡིན།
en: meditative concentration without afflictive emotions,

source: རྒྱལ་མཚན་གྱི་རྩེ་མོའི་དཔུང་རྒྱན་གྱི་ཏིང་ངེ་འཛིན་དང་ལྡན་པ་ཡིན་ཏེ།
en: and victory-banner finial meditative concentration.

source: བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཅུ་པོ་དེ་དག་དང་ལྡན་ན་
en: if a bodhisattva possesses these ten qualities,

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཏེ་
en: The bodhisattva mahāsattva Maitreya was then satisfied and delighted.

source: རབ་ཏུ་དགའ་ནས་དགའ་བ་དང་ཡིད་བདེ་བ་སྐྱེས་ཏེ།
en: Joyful and pleased,

source: སྟན་ལས་ལངས་ནས་
en: he rose from his seat,

source: བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ཏེ་
en: draped his shawl over one shoulder,

source: པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས།
en: set his right knee on the ground,

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ།
en: and bowed to the Blessed One with joined palms.

source: བཅོམ་ལྡན་འདས་ལ་ཚུལ་དང་འདྲ་བའི་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ།
en: He praised the Blessed One with these fitting verses:
